<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
	import="java.util.*"%>
<!DOCTYPE html>
<!--
Template Name: Boguco
Author: <a href="https://www.os-templates.com/">OS Templates</a>
Author URI: https://www.os-templates.com/
Licence: Free to use under our free template licence terms
Licence URI: https://www.os-templates.com/template-terms
-->
<html>
<!--윤지애 : 탭 이름-->
<head>
<title>CNU information | About</title>
<meta charset="utf-8">
<meta name="viewport"
	content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
<!--외부 소스 : 외부 css 연결-->
<link href="../layout/styles/layout.css" rel="stylesheet"
	type="text/css" media="all">
</head>
<body id="top">
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!--유정연 : 최상단 include-->
	<%@include file="Upper_part.jsp"%>

	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- Top Background Image Wrapper -->
	<!--유정연 : 메뉴가 포함된 상단-->
	<div class="bgded overlay"
		style="background-image: url('../images/demo/backgrounds/01.png');">
		<!-- ################################################################################################ -->
		<!--유정연 : 메뉴가 포함된 상단을 include-->
		<%@include file="dropdown.jsp"%>
		<!-- ################################################################################################ -->
		<!-- ################################################################################################ -->
		<!-- ################################################################################################ -->
		<!--윤지애 : 세부 메뉴-->
		<div class="wrapper row2">
			<div id="breadcrumb" class="hoc clear">
				<!-- ################################################################################################ -->
				<ul>
					<li><a href="../index.html">Home</a></li>
					<li><a href="notice.html">ABOUT</a></li>
				</ul>
				<!-- ################################################################################################ -->
			</div>
		</div>
		<!-- ################################################################################################ -->
	</div>
	<!-- End Top Background Image Wrapper -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!--윤지애 : 개발자 정보-->
	<div class="wrapper row3">
		<main class="hoc container clear"> <!-- main body --> <!-- ################################################################################################ -->
		<div class="developer content">
			<!-- ################################################################################################ -->
			<h1>개발자 정보</h1>
			<!--사이트 공지사항-->
			<!-- #############################################################################-->
			<div id="yeon">
				<img class="imgr borderedbox inspace-5"
					src="../images/demo/imgr.gif"
					style="width: 200px; margin-right: 80px;" alt="">
				<p style="font-size: 20px;">
					<strong>유정연</strong>
				</p>
				<p>충남대학교 환경공학과 환경ict 16학번</p>
				<p>call : 010-2264-8359</p>
				<p>mail : dbwjddus19@gmail.com</p>
				<p>
					site : <a href="http://yjyblogstudyit.tistory.com/">JungYeon
						Blog</a>
				</p>
				<p>
					gitHub : <a href="https://github.com/Yeon1123">JungYeon Git</a>
				</p>
			</div>
			<br> <br> <img class="imgl borderedbox inspace-5"
				src="../images/demo/imgl.gif" style="width: 200px;" alt="">
			<div id="ae" style="float: right; margin-right: 80px">
				<p style="font-size: 20px;">
					<strong>윤지애</strong>
				</p>
				<p>충남대학교 정보통계학과 언어정보처리전공 16학번</p>
				<p>call : 010-2264-8359</p>
				<p>mail : dbwjddus19@gmail.com</p>
				<p>
					site : <a href="http://blog.naver.com/yja0203">JIAE Blog</a>
				</p>
				<p>
					gitHub : <a href="https://github.com/yja2397">JIAE Git</a>
				</p>
			</div>
		</div>
		<!-- ################################################################################################ -->
		<!-- / main body -->
		<div class="clear"></div>
		</main>
	</div>
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- ################################################################################################ -->
	<!-- Footer Background Image Wrapper -->
	<!--유정연 : footer를 include-->
	<%@include file="Under_part.jsp"%>
</body>
</html>